app.run(function($rootScope) {
    $rootScope.lesson = [{}, {
        "title": ["Додавання",
         "Addition",
         "Добавление"],
        "content": [
        "При виконанні усної математики краще робити це рухаючись зліва направо. Переключати порядок так, що ви починаєте з найбільших значень, це робить його трохи більш інтуїтивним і легше зрозуміти. Тому при додаванні 58 до 26 починають з першого стовпця і обчислюють 50 + 20 = 70, потім 8 + 6 = 14, які додають разом 84. Легко і просто!",
         "When performing mental math it’s better to do it moving from left to right. Switching the order so that you start with the largest values makes it a bit more intuitive and easier to figure out. So when adding 58 to 26, start with the first column and calculate 50+20=70, then 8+6=14, which added together is 84. Easy, peasy.",
         "При выполнении умственной математики лучше делать это, двигаясь слева направо. Переключение порядка так, чтобы вы начали с самых больших значений, делает его немного более интуитивным и более простым для понимания. Поэтому при добавлении 58 к 26 начните с первого столбца и вычислите 50 + 20 = 70, затем 8 + 6 = 14, что в сумме составляет 84. Легко, и просто."]
    }, {
        "title": ["Віднімання 5",
         "Subtraction of 5",
         "Вычитание 5",
         ],
        "content": ["При відніманні 5 з числа, що закінчується цифрою, меншою за 5, легше спочатку додати 5, а потім відняти 10. Наприклад, 23 - 5 = 18. Також 23 + 5 = 28; 28 - 10 = 18.",
         "When subtracting 5 from a number ending with a a digit smaller than 5, it is easier to first add 5 and then subtract 10. For example, 23 - 5 = 18. Also 23 + 5 = 28; 28 - 10 = 18.",
         "При вычитании 5 из числа, заканчивающегося цифрой меньше 5, легче сначала добавить 5, а затем вычесть 10. Например, 23 - 5 = 18. Также 23 + 5 = 28; 28 - 10 = 18.",
         ]
    }, {
        "title": ["Ділення на 5",
         "Division by 5",
         "Деление на 5",
         ],
        "content": ["Аналогічно, найчастіше зручніше спочатку помножити на 2, а потім поділити на 10. Наприклад, 1375/5 = 2750/10 = 275.",
         "Similarly, it's often more convenient instead to multiply first by 2 and then divide by 10. For example, 1375/5 = 2750/10 = 275.",
         "Точно так же часто удобнее вместо этого сначала умножать на 2, а затем делить на 10. Например, 1375/5 = 2750/10 = 275",
         ],
    }, {
        "title": ["Ділення / множення на 4",
         "Division/multiplication by 4",
         "Деление / умножение на 4",
         ],
        "content": ["Зробіть повторну операцію 2 раза. Наприклад, 124/4 = 62/2 = 31. Також 124 × 4 = 248 × 2 = 496.",
         "Replace either with a repeated operation by 2. For example, 124/4 = 62/2 = 31. Also, 124×4 = 248×2 = 496.",
         "Сделайте повторную операцию 2 раза. Например, 124/4 = 62/2 = 31. Also, 124×4 = 248×2 = 496.",
         ],
    }, {
        "title": ["Ділення / множення на 25",
         "Division/multiplication by 25",
         "Деление / умножение на 25",
         ],
        "content": ["Замість цього використовуйте операції з 4. Наприклад, 37 × 25 = 3700/4 = 1850/2 = 925.",
         "Use operations with 4 instead. For example, 37×25 = 3700/4 = 1850/2 = 925.",
         "Вместо этого используйте операции с 4. Например, 37 × 25 = 3700/4 = 1850/2 = 925.",
         ],
    }, {
        "title": ["Ділення / множення на 8",
         "Division/multiplication by 8",
         "Деление / умножение на 8",
         ],
        "content": ["Замініть на повторну операцію з 2. Наприклад, 124 × 8 = 248 × 4 = 496 × 2 = 992.",
         "Replace either with a repeated operation by 2. For example, 124×8 = 248×4 = 496×2 = 992.",
         "Замените на повторную операцию с 2. Например, 124×8 = 248×4 = 496×2 = 992.",
         ],
    }, {
        "title": ["Ділення / множення на 125",
         "Division/multiplication by 125",
         "Деление / умножение на 125",
         ],
        "content": ["Замість цього використовуйте операції з 8. Наприклад, 37 × 125 = 37000/8 = 18500/4 = 9250/2 = 4625.",
         "Use operations with 8 instead. For example, 37×125 = 37000/8 = 18500/4 = 9250/2 = 4625.",
         "Вместо этого используйте операции с 8. Например, 37 × 125 = 37000/8 = 18500/4 = 9250/2 = 4625.",
         ],
    }, {
        "title": ["Зведення в квадрат двозначних чисел",
         "Squaring two digit numbers",
         "Возведение в квадрат двухзначных чисел",
         ],
        "content": ["Ви повинні запам'ятати перші 25 квадратів: 1 4 9 16 25 36 49 64 81 100 121 144 169 196 225 256 289 324 361 400 441 484 529 576 625",
         "You should memorize the first 25 squares: 1  4   9   16  25  36  49  64  81  100 121 144 169 196 225 256 289 324 361 400 441 484 529 576 625",
         "Вы должны запомнить первые 25 квадратов: 1 4 9 16 25 36 49 64 81 100 121 144 169 196 225 256 289 324 361 400 441 484 529 576 625",
         ],
    }, {
        "title": ["Любий квадрат",
         "Any Square",
         "Любой квадрат",
         ],
        "content": ["Припустимо, ви хочете знайти 87². Знайти просте число поруч - число, квадрат якого можна знайти відносно легко. У випадку 87 ми беремо 90. Щоб отримати 90, потрібно додати 3 до 87; тепер давайте відняти 3 від 87. Ми отримуємо 84. Нарешті, 87² = 90 × 84 + 3² = 7200 + 360 + 9 = 7569.",
         "Assume you want to find 87². Find a simple number nearby - a number whose square could be found relatively easy. In the case of 87 we take 90. To obtain 90, we need to add 3 to 87; so now let's subtract 3 from 87. We are getting 84. Finally, 87² = 90×84 + 3² = 7200 + 360 + 9 = 7569.",
         "Предположим, вы хотите найти 87². Найдите рядом простое число - число, квадрат которого можно найти относительно легко. В случае 87 мы берем 90. Чтобы получить 90, нам нужно добавить 3 к 87; так что теперь давайте вычтем 3 из 87. Мы получаем 84. Наконец, 87² = 90 × 84 + 3² = 7200 + 360 + 9 = 7569.",
         ],
    }, {
        "title": ["Квадрати можна розраховувати послідовно.",
         "Squares Can Be Computed Squentially",
         "Квадраты могут быть вычислены последовательно",
         ],
        "content": ["У випадку, якщо 'A' є наступником числа з відомим квадратом, ви знайдете 'An' шляхом додавання до останнього, а потім 'A'. Наприклад, 'A' = 111 є наступником 'An' = 110, квадрат якого становить 12100. Додано до цього 110 і потім 111 для отримання 'A'²: 111² = 110² + 110 + 111 = 12100 + 221 = 12321.",
         "In case 'A' is a successor of a number with a known square, you find 'An' by adding to the latter itself and then 'A'. For example, 'A' = 111 is a successor of 'An' = 110 whose square is 12100. Added to this 110 and then 111 to get A²: 111² = 110² + 110 + 111 = 12100 + 221 = 12321.",
         "В случае, если «A» является преемником числа с известным квадратом, вы можете найти «An» , добавив к самому последнему, а затем «A». Например, «A» = 111 является преемником «An» = 110, чей квадрат равен 12100. Добавьте к этому 110, а затем 111, чтобы получить «A»²: 111² = 110² + 110 + 111 = 12100 + 221 = 12321.",
         ],
    }, {
        "title": ["Квадрати чисел, що закінчуються 5",
         "Squares of numbers that end with 5",
         "Квадраты чисел, заканчивающиеся на 5",
         ],
        "content": ["Число, що закінчується на 5, має вигляд A = 10a + 5, де a має одну цифру менше A. Щоб знайти квадрат A² з A, додайте до продукту a × (a + 1) a з його наступником 25. Наприклад, обчислити 115². 115 = 11 × 10 + 5, так що a = 11. Спочатку обчислимо 11 × (11 + 1) = 11 × 12 = 132 (з 3 = 1 + 2). Далі, додайте 25 праворуч від 132, щоб отримати 13225!",
         "A number that ends in 5 has the form A = 10a + 5, where a has one digit less than A. To find the square A² of A, append 25 to the product a×(a + 1) of a with its successor. For example, compute 115². 115 = 11×10 + 5, so that a = 11. First compute 11×(11 + 1) = 11×12 = 132 (since 3 = 1 + 2). Next, append 25 to the right of 132 to get 13225!",
         "Число, оканчивающееся на 5, имеет вид A = 10a + 5, где a на одну цифру меньше A. Чтобы найти квадрат A² в A, добавьте 25 к произведению a × (a + 1) of a с его преемником. Например, вычислите 115². 115 = 11 × 10 + 5, так что a = 11. Сначала вычислите 11 × (11 + 1) = 11 × 12 = 132 (так как 3 = 1 + 2). Затем добавьте 25 справа от 132, чтобы получить 13225!",
         ],
    }, ]
    $rootScope.fix = [{
        'date': '07:07 03.02.2019',
        'fix': 'Beta-testing We are improving lessons and practice scenes now.'
    }, {
        'date': '12:20  04.02.2019',
        'fix': 'Fixed some bugs with tips of a day, lessons and sounds settings.'
    }, {
        'date': '14:25 04.02.2019',
        'fix': '-Fixed redirect to lessons page, and if lesson is undefined then  "There is no lesson to this level yet!" -Improved in info page footer.'
    }, {
        'date': '21:15 04.02.2019',
        'fix': '-New design! Fixed some bugs'
    }]
    $rootScope.fix.reverse()
})